package com.javarush.test.level03.lesson12.home01;

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
        System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
